{
    "jobs": [
        {
            "company": "Eastern Drayage",
            "title": "Director of Technology / Senior Software Engineer",
            "timeframe": "May 2022 - Present",
            "description": "Own internal platforms across backend services, integrations, customer portals, and driver applications. Stabilized a legacy core app, added audit logging and database indexing, led EDI architecture with Stedi, built Laravel APIs and admin systems, delivered Vue customer portal and Ionic (Angular) driver PWA, implemented CargoSnap imaging workflows, and migrated infrastructure to AWS with emergency backup systems."
        },
        {
            "company": "Hertz Furniture",
            "title": "Full Stack Developer",
            "timeframe": "Oct 2017 - May 2022",
            "description": "Developed and maintained internal web applications and APIs supporting operations and sales. Built single-page applications and backend services, worked on automation and scripting, improved UI/UX, and supported mobile development and internal tooling."
        },
        {
            "company": "HY Enterprises",
            "title": "Full Stack Developer",
            "timeframe": "Feb 2016 - Oct 2017",
            "description": "Built marketing and e-commerce websites using PHP, JavaScript, MySQL, and WordPress. Delivered multiple client-facing properties, managed VPS environments with LAMP stacks, and handled basic IT support including hardware and software troubleshooting."
        },
        {
            "company": "Sequoia Development Group",
            "title": "IT & Web Developer",
            "timeframe": "2013 - 2015",
            "description": "Oversaw a new office setup including computers, printers, networking, and PBX systems. Developed internal tools and company websites and handled IT operations including servers, networking, and user support."
        },
        {
            "company": "BRH Medical South Africa",
            "title": "Technology Consultant",
            "timeframe": "Apr 2013 - Aug 2013",
            "description": "Helped establish the South African branch of a biomedical company. Built multiple websites, supported marketing initiatives, and assisted with technical planning and third-party partnerships."
        },
        {
            "company": "JCN Network (DBA Old Junk Car)",
            "title": "IT & Web Developer",
            "timeframe": "2011 - 2013",
            "description": "Developed WordPress-based websites and internal tools, maintained on-prem Windows servers and office networks, and provided hardware repair and ongoing IT support."
        }
    ]
}
