{
    "personalProjects": [
        {
            "title": "Frum Philly ",
            "show": false,
            "description": "A fullstack Django application for the Philadelphia and South Jersey Jewish communities.",
            "stack": "Python / Django / PostgresSQL / TailwindCSS / AlpineJS ",
            "buttons": [
                {
                    "title": "Github",
                    "link": "https://github.com/dherskowitz/firefox-right-click-search"
                },
                {
                    "title": "Firefox Add-Ons Page",
                    "link": "https://addons.mozilla.org/en-US/firefox/addon/right-click-search/"
                }
            ]
        },
        {
            "title": "Firefox Right Click Search ",
            "show": false,
            "description": "A Firefox browser add-on to search a saved search engine from the context menu. ",
            "stack": "JavaScript",
            "buttons": [
                {
                    "title": "Github",
                    "link": "https://github.com/dherskowitz/firefox-right-click-search"
                },
                {
                    "title": "Firefox Add-Ons Page",
                    "link": "https://addons.mozilla.org/en-US/firefox/addon/right-click-search/"
                }
            ]
        },
        {
            "title": "Firefox Convert HTTP Bookmarks ",
            "show": false,
            "description": "A Firefox extension to find all HTTP bookmarks and convert them to HTTPS. ",
            "stack": "JavaScript",
            "buttons": [
                {
                    "title": "Github",
                    "link": "https://github.com/dherskowitz/firefox-convert-http-bookmarks"
                },
                {
                    "title": "Firefox Add-Ons Page",
                    "link": "https://addons.mozilla.org/en-US/firefox/addon/bookmarks-to-https/"
                }
            ]
        },
        {
            "title": "Dollar-to-NIS ",
            "show": false,
            "description": "A Progressive Web App to convert between USD & NIS. ",
            "stack": "JavaScript / Gridsome ",
            "buttons": [
                {
                    "title": "Github",
                    "link": "https://github.com/dherskowitz/dollar-to-nis"
                },
                {
                    "title": "Website",
                    "link": "https://dollar-to-nis.vercel.app/"
                }
            ]
        },
        {
            "title": "What Time Is Shabbos ",
            "show": false,
            "description": "A Progressive Web App to get the Sabbath start/end times for a given region. ",
            "stack": "JavaScript / Gridsome / Python / AWS Lambda ",
            "buttons": [
                {
                    "title": "Github",
                    "link": "https://github.com/dherskowitz/whatTimeIsShabbos"
                },
                {
                    "title": "Website",
                    "link": "https://what-time-is-shabbos.vercel.app/"
                }
            ]
        },
        {
            "title": "Safari Judaica ",
            "show": false,
            "description": "A sample JAMstack site using Airtable as a Database and product data copied from safarijudaica.com with permission from the site owner. ",
            "stack": "JavaScript / Gridsome / Airtable ",
            "buttons": [
                {
                    "title": "Github",
                    "link": "https://github.com/dherskowitz/safari-judaica"
                },
                {
                    "title": "Website",
                    "link": "https://safari-judaica.vercel.app/"
                }
            ]
        },
        {
            "title": "Tal Chaim ",
            "show": false,
            "description": "A static site with a serverless contact form submitting to an AWS Lambda function which uses AWS SES to send an email to the site owner. ",
            "stack": "Astro",
            "buttons": [
                {
                    "title": "Website",
                    "link": "https://talchaim.com/"
                }
            ]
        },
        {
            "title": "VidVault",
            "show": false,
            "description": "An Astro application connected to a Pocketbase backend to track and log Movies and TV Shows with data from TMDB",
            "stack": "Astro",
            "buttons": [
                {
                    "title": "Website",
                    "link": false
                }
            ]
        }
    ],
    "companies": [
        {
            "title": "Eastern Drayage",
            "subtitle": "Some of the projects I worked on while employed at Eastern Drayage:",
            "stack": "Projects at Hertz Furniture were built using Python / Django / PHP / Laravel / Node.js / Vue / Ionic (Angular) / PostgreSQL / MySQL / AWS / Docker / Stedi (EDI) / CargoSnap",
            "projects": [
                {
                    "title": "Core Operations Platform Modernization",
                    "description": "Stabilization and enhancement of a legacy logistics application, reducing crashes, improving reliability, and enabling continued feature development without disrupting daily operations."
                },
                {
                    "title": "Unified Inventory Management System",
                    "description": "A consolidated inventory platform merging multiple disconnected systems into a single source of truth for operational and reporting workflows."
                },
                {
                    "title": "EDI Event Processing & Integration Platform",
                    "description": "An event-driven EDI system using database triggers and Python services to aggregate outbound events, process inbound queues, and automate order entry via the Stedi API."
                },
                {
                    "title": "Emergency Data Backup & Resilience System",
                    "description": "A Python-based emergency backup solution exporting critical operational data to CSV, eliminating reliance on a legacy backup process that degraded application performance."
                },
                {
                    "title": "Customer Reporting & Data Export Platform",
                    "description": "Custom reporting solutions developed in collaboration with customers and account managers, delivering tailored operational and financial data outputs per customer specifications."
                },
                {
                    "title": "Driver Mobile Application (PWA)",
                    "description": "A cross-platform driver application built with Ionic (Angular) for trip reporting, deployed as a Progressive Web App with architecture prepared for future App Store distribution."
                },
                {
                    "title": "Driver SMS Automation System",
                    "description": "An SMS chatbot enabling drivers to report port and terminal in-gate and out-gate activity, reducing manual communication and improving real-time operational visibility."
                },
                {
                    "title": "Customer Portal",
                    "description": "A Vue-based customer portal allowing customers to view shipment status and submit operational updates, powered by a Laravel API and deployed via AWS S3 with automated CI/CD."
                },
                {
                    "title": "Multi-Service Laravel API & Admin Platform",
                    "description": "A central Laravel-based API serving multiple internal and external systems, including customer portals, driver applications, and an internal administrative interface."
                },
                {
                    "title": "Document Data Extraction & Processing System",
                    "description": "A Django API leveraging Google Document AI to extract structured data from customer PDF files, delivering normalized JSON for downstream workflows."
                },
                {
                    "title": "Bill of Lading (BOL) Creation Tool",
                    "description": "A web-based workflow allowing users to review extracted document data and generate flatbed load Bills of Lading by selecting and validating imported line items."
                },
                {
                    "title": "Driver Identity & Access Management System",
                    "description": "An automated driver onboarding system with invitation-based account creation, email-driven password setup, and role-based access control across driver applications."
                },
                {
                    "title": "CargoSnap Imaging Integration",
                    "description": "Implementation and rollout of CargoSnap to standardize container, chassis, and cargo photo documentation, improving accountability, audit trails, and dispute resolution."
                },
                {
                    "title": "Yard Information Dashboard & Kiosk System",
                    "description": "A real-time yard operations dashboard deployed as a kiosk application in warehouse and yard offices to provide operational visibility to staff."
                },
                {
                    "title": "Cloud Infrastructure Modernization",
                    "description": "Migration from legacy servers to AWS-based infrastructure, including RDS, Elastic Beanstalk, PWA hosting, and Dockerized services for production systems."
                }
            ]
        },
        {
            "title": "Hertz Furniture",
            "subtitle": "Some of the projects I worked on while employed at Hertz Furniture: ",
            "stack": "Projects at Hertz Furniture were built using PHP / Yii Framework / JavaScript / Webix UI / Webix Jet / MySQL / Airtable / WordPress",
            "projects": [
                {
                    "title": "Vendor Portal ",
                    "description": "A single page application for managing the pipeline of products and product data from vendors to the Hertz Furniture website. "
                },
                {
                    "title": "Order Entry & Management Portal ",
                    "description": "A single page application built to replace functionality from an IBM AS-400 system. The application consists of a number of modules with varying functionality based around data entry and reporting. "
                },
                {
                    "title": "Ionic App ",
                    "description": "A mobile catalog application built with Ionic and Angular. "
                },
                {
                    "title": "Airtable Sync ",
                    "description": "A script to grab data from multiple Airtable bases/tables and create tables in the local MySQL database. "
                },
                {
                    "title": "Trello Sync ",
                    "description": "A script to grab data from multiple Trello boards/cards and create a report based on the collected data. "
                },
                {
                    "title": "Order Files Fetching ",
                    "description": "A script to connect to an email account, get the unread email, save the attachments, and mark each processed email as read. Used in leiu of an API from the service provider. "
                },
                {
                    "title": "Leads response ",
                    "description": "Added the functionality to respond to a lead from the existing leads datatable using the data from the lead and a modal to view and send the response. "
                },
                {
                    "title": "Email Signature Generator ",
                    "description": "Generates a company email signature based on current user and company role. User can do limited additional customization and copy the result to be pasted in their preferred email client. "
                },
                {
                    "title": "Instagram Page ",
                    "description": "A landing page linked to in the company Instagram account with data retrieved from a WordPress REST API. "
                },
                {
                    "title": "Gallery Page ",
                    "description": "A gallery page originally retrieving content from Airtable using the API and later converted to use local data synced from Airtable. "
                }
            ]
        }
    ]
}